Update the README file
